IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28p65x_epg_regs.xml
<module id="EPG_REGS" HW_revision="" description="EPG Registers">
	<register id="GCTL0" width="32" page="1" offset="0x0" internal="0" description="EPG Global control register 0">
		<bitfield id="EN" description="Enable EPG" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="SIGGEN0_EN" description="Signal generator enable" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="SIGGEN1_EN" description="Signal generator enable" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="EPGOUT13SEL" description="EPG output 13 Clock/signal select" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="EPGOUT15SEL" description="EPG output 15 Clock/signal select" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="EPGOUT16SEL" description="EPG output 16 Clock/signal select" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="EPGOUT17SEL" description="EPG output 17 Clock/signal select" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="EPGOUT20SEL" description="EPG output 20 Clock/signal select" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="EPGOUT21SEL" description="EPG output 21 Clock/signal select" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="EPGOUT22SEL" description="EPG output 22 Clock/signal select" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="EPGOUT23SEL" description="EPG output 23 Clock/signal select" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="GCTL1" width="32" page="1" offset="0x2" internal="0" description="EPG Global control register 1">
		<bitfield id="SIGGEN0_CLKSEL" description="Clock source select of SIGGEN0" begin="2" end="0" width="3" rwaccess="RW"/>
	</register>
	<register id="GCTL2" width="32" page="1" offset="0x4" internal="0" description="EPG Global control register 2">
		<bitfield id="EPGOUT0_CLKOUTSEL" description="Selects the clock signal source of EPG output 0." begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="EPGOUT1_CLKOUTSEL" description="Selects the clock signal source of EPG output 1." begin="6" end="4" width="3" rwaccess="RW"/>
		<bitfield id="EPGOUT2_CLKOUTSEL" description="Selects the clock signal source of EPG output 2." begin="10" end="8" width="3" rwaccess="RW"/>
		<bitfield id="EPGOUT3_CLKOUTSEL" description="Selects the clock signal source of EPG output 3." begin="14" end="12" width="3" rwaccess="RW"/>
		<bitfield id="EPGOUT4_CLKOUTSEL" description="Selects the clock signal source of EPG output 4." begin="18" end="16" width="3" rwaccess="RW"/>
		<bitfield id="EPGOUT5_CLKOUTSEL" description="Selects the clock signal source of EPG output 5." begin="22" end="20" width="3" rwaccess="RW"/>
		<bitfield id="EPGOUT6_CLKOUTSEL" description="Selects the clock signal source of EPG output 6." begin="26" end="24" width="3" rwaccess="RW"/>
		<bitfield id="EPGOUT7_CLKOUTSEL" description="Selects the clock signal source of EPG output 7." begin="30" end="28" width="3" rwaccess="RW"/>
	</register>
	<register id="GCTL3" width="32" page="1" offset="0x6" internal="0" description="EPG Global control register 3">
		<bitfield id="EPGOUT0_SIGOUTSEL" description="Selects the signal source of EPG output 0." begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="EPGOUT1_SIGOUTSEL" description="Selects the signal source of EPG output 1." begin="7" end="4" width="4" rwaccess="RW"/>
		<bitfield id="EPGOUT2_SIGOUTSEL" description="Selects the signal source of EPG output 2." begin="11" end="8" width="4" rwaccess="RW"/>
		<bitfield id="EPGOUT3_SIGOUTSEL" description="Selects the signal source of EPG output 3." begin="15" end="12" width="4" rwaccess="RW"/>
		<bitfield id="EPGOUT4_SIGOUTSEL" description="Selects the signal source of EPG output 4." begin="19" end="16" width="4" rwaccess="RW"/>
		<bitfield id="EPGOUT5_SIGOUTSEL" description="Selects the signal source of EPG output 5." begin="23" end="20" width="4" rwaccess="RW"/>
		<bitfield id="EPGOUT6_SIGOUTSEL" description="Selects the signal source of EPG output 6." begin="27" end="24" width="4" rwaccess="RW"/>
		<bitfield id="EPGOUT7_SIGOUTSEL" description="Selects the signal source of EPG output 7." begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
	<register id="EPGLOCK" width="32" page="1" offset="0x8" internal="0" description="EPG LOCK Register">
		<bitfield id="GCTL0" description="GCTL0 Lock bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GCTL1" description="GCTL1 Lock bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GCTL2" description="GCTL2 Lock bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GCTL3" description="GCTL3 Lock bit" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="CLKDIV0_CTL0" description="CLKDIV0_CTL0 Lock bit" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="CLKDIV1_CTL0" description="CLKDIV1_CTL0 Lock bit" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="SIGGEN0_CTL0" description="SIGGEN0_CTL0 Lock bit" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="SIGGEN0_CTL1" description="SIGGEN0_CTL1 Lock bit" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="EPGCOMMIT" width="32" page="1" offset="0xa" internal="0" description="EPG COMMIT register">
		<bitfield id="GCTL0" description="GCTL0 Commit bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GCTL1" description="GCTL1 Commit bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GCTL2" description="GCTL2 Commit bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GCTL3" description="GCTL3 Commit bit" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="CLKDIV0_CTL0" description="CLKDIV0_CTL0 Commit bit" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="CLKDIV1_CTL0" description="CLKDIV1_CTL0 Commit bit" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="SIGGEN0_CTL0" description="SIGGEN0_CTL0 Commit bit" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="SIGGEN0_CTL1" description="SIGGEN0_CTL1 Commit bit" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="GINTSTS" width="32" page="1" offset="0xc" internal="0" description="EPG Global interrupt status register.">
		<bitfield id="INT" description="Global interrupt flag register" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="SIGGEN0_DONE" description="SIGGEN0 operation done status" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="SIGGEN0_FILL" description="SIGGEN0 data fill status" begin="2" end="2" width="1" rwaccess="R"/>
	</register>
	<register id="GINTEN" width="32" page="1" offset="0xe" internal="0" description="EPG Global interrupt enable register.">
		<bitfield id="SIGGEN0_DONE" description="SIGGEN0 operation done interrupt enable" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="SIGGEN0_FILL" description="SIGGEN0 data fill interrupt enable" begin="2" end="2" width="1" rwaccess="RW"/>
	</register>
	<register id="GINTCLR" width="32" page="1" offset="0x10" internal="0" description="EPG Global interrupt clear register.">
		<bitfield id="INT" description="Global interrupt flag clear" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="SIGGEN0_DONE" description="SIGGEN0 operation done interrupt flag clear" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="SIGGEN0_FILL" description="SIGGEN0 data fill interrupt flag clear" begin="2" end="2" width="1" rwaccess="RW"/>
	</register>
	<register id="GINTFRC" width="32" page="1" offset="0x12" internal="0" description="EPG Global interrupt force register.">
		<bitfield id="SIGGEN0_DONE" description="SIGGEN0 operation done interrupt flag set" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="SIGGEN0_FILL" description="SIGGEN0 data fill interrupt flag set" begin="2" end="2" width="1" rwaccess="RW"/>
	</register>
	<register id="CLKDIV0_CTL0" width="32" page="1" offset="0x18" internal="0" description="Clock divider 0's control register 0">
		<bitfield id="PRD" description="Clock divider value" begin="15" end="0" width="16" rwaccess="RW"/>
		<bitfield id="CLKSTOP" description="Clock Stop Configuration" begin="18" end="16" width="3" rwaccess="RW"/>
	</register>
	<register id="CLKDIV0_CLKOFFSET" width="32" page="1" offset="0x1e" internal="0" description="Clock divider 0's clock offset value">
		<bitfield id="CLK0OFFSET" description="Clock output 0 offset delay value." begin="7" end="0" width="8" rwaccess="RW"/>
		<bitfield id="CLK1OFFSET" description="Clock output 0 offset delay value." begin="15" end="8" width="8" rwaccess="RW"/>
		<bitfield id="CLK2OFFSET" description="Clock output 0 offset delay value." begin="23" end="16" width="8" rwaccess="RW"/>
		<bitfield id="CLK3OFFSET" description="Clock output 0 offset delay value." begin="31" end="24" width="8" rwaccess="RW"/>
	</register>
	<register id="CLKDIV1_CTL0" width="32" page="1" offset="0x24" internal="0" description="Clock divider 1's control register 0">
		<bitfield id="PRD" description="Clock divider value" begin="15" end="0" width="16" rwaccess="RW"/>
		<bitfield id="CLKSTOP" description="Clock Stop Configuration" begin="18" end="16" width="3" rwaccess="RW"/>
	</register>
	<register id="CLKDIV1_CLKOFFSET" width="32" page="1" offset="0x2a" internal="0" description="Clock divider 1's clock offset value">
		<bitfield id="CLK0OFFSET" description="Clock output 0 offset delay value." begin="7" end="0" width="8" rwaccess="RW"/>
		<bitfield id="CLK1OFFSET" description="Clock output 0 offset delay value." begin="15" end="8" width="8" rwaccess="RW"/>
		<bitfield id="CLK2OFFSET" description="Clock output 0 offset delay value." begin="23" end="16" width="8" rwaccess="RW"/>
		<bitfield id="CLK3OFFSET" description="Clock output 0 offset delay value." begin="31" end="24" width="8" rwaccess="RW"/>
	</register>
	<register id="SIGGEN0_CTL0" width="32" page="1" offset="0x30" internal="0" description="Signal generator 0's control register 0">
		<bitfield id="MODE" description="Signal generator modes" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="BRIN" description="Reverse bits before transform" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="BROUT" description="Reverse bits after transform" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="BITLENGTH" description="Length of bit stream" begin="23" end="16" width="8" rwaccess="RW"/>
	</register>
	<register id="SIGGEN0_CTL1" width="32" page="1" offset="0x32" internal="0" description="Signal generator 0's control register 1">
		<bitfield id="DATA0_INSEL" description="Select the source of DATA[0] bit." begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="DATA63_INSEL" description="Select the source of DATA[63] bit." begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
	<register id="SIGGEN0_DATA0" width="32" page="1" offset="0x38" internal="0" description="Signal generator 0's data register 0">
		<bitfield id="SIGGEN_DATA0" description="Data 0" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="SIGGEN0_DATA1" width="32" page="1" offset="0x3a" internal="0" description="Signal generator 0's data register 1">
		<bitfield id="SIGGEN_DATA1" description="Data 1" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="SIGGEN0_DATA0_ACTIVE" width="32" page="1" offset="0x3c" internal="0" description="Signal generator 0's data active register 0">
		<bitfield id="SIGEN_DATA0" description="Data 0" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="SIGGEN0_DATA1_ACTIVE" width="32" page="1" offset="0x3e" internal="0" description="Signal generator 0's data active register 1">
		<bitfield id="SIGGEN_DATA1" description="Data 1" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="REVISION" width="32" page="1" offset="0x50" internal="0" description="IP Revision tie-off value">
		<bitfield id="MINOR" description="Minor Revision Number" begin="5" end="0" width="6" rwaccess="R"/>
		<bitfield id="CUSTOM" description="Custom Module Number" begin="7" end="6" width="2" rwaccess="R"/>
		<bitfield id="MAJOR" description="Major Revision Number" begin="10" end="8" width="3" rwaccess="R"/>
		<bitfield id="FUNC" description="Functional Release Number" begin="27" end="16" width="12" rwaccess="R"/>
		<bitfield id="SCHEME" description="Defines Scheme for Module" begin="31" end="30" width="2" rwaccess="R"/>
	</register>
</module>
